## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # datadog_metric_metadata.custom["grants_ingest.DownloadGrantsGovDB.source_size"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.DownloadGrantsGovDB.source_size"
-       type            = "gauge" -> null
        # (6 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.created"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.created"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.failed"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.skipped"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # datadog_metric_metadata.custom["grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"] will be updated in-place
  ~ resource "datadog_metric_metadata" "custom" {
        id              = "grants_ingest.SplitGrantsGovXMLDB.opportunity.updated"
-       type            = "gauge" -> null
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2023-06-09T16:12:08.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadFFISSpreadsheet:8/invocations" -> (known after apply)
      ~ s3_key                         = "builds/3ea2aba12982bf03c5182aa1bae2def06525a059f32ff0d373fb3f9326aae160.zip" -> "builds/6c754cfd284e73f5b606a20a9e3be2440443b9087ebb22a46d9871aae0d45f13.zip"
      ~ s3_object_version              = "_knp4c77gCpweP81OKLDJL_9xNVT2Iwf" -> (known after apply)
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:0269adc401dc80dc8dfa65cea10aa713a18e3826,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet" -> "git.commit.sha:c0b2fcb5cb4476d145da449399765cef2ffa5171,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadffisspreadsheet"
              ~ "DD_VERSION"                   = "0269adc401dc80dc8dfa65cea10aa713a18e3826" -> "c0b2fcb5cb4476d145da449399765cef2ffa5171"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "8" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "9119ac2ae42d55b140d90983d3b9d33b-2" -> (known after apply)
      ~ id                     = "builds/3ea2aba12982bf03c5182aa1bae2def06525a059f32ff0d373fb3f9326aae160.zip" -> (known after apply)
      ~ key                    = "builds/3ea2aba12982bf03c5182aa1bae2def06525a059f32ff0d373fb3f9326aae160.zip" -> "builds/6c754cfd284e73f5b606a20a9e3be2440443b9087ebb22a46d9871aae0d45f13.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/3ea2aba12982bf03c5182aa1bae2def06525a059f32ff0d373fb3f9326aae160.zip" -> "builds/6c754cfd284e73f5b606a20a9e3be2440443b9087ebb22a46d9871aae0d45f13.zip"
-       tags                   = {} -> null
      ~ version_id             = "_knp4c77gCpweP81OKLDJL_9xNVT2Iwf" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadFFISSpreadsheet
                            cd bin/DownloadFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/6c754cfd284e73f5b606a20a9e3be2440443b9087ebb22a46d9871aae0d45f13.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/6c754cfd284e73f5b606a20a9e3be2440443b9087ebb22a46d9871aae0d45f13.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "7784324557405157798" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/3ea2aba12982bf03c5182aa1bae2def06525a059f32ff0d373fb3f9326aae160.zip" -> "builds/6c754cfd284e73f5b606a20a9e3be2440443b9087ebb22a46d9871aae0d45f13.zip"
          ~ "timestamp" = "1686327096222672000" -> "1687388338490981200"
        }
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "5631970978334952737" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/3ea2aba12982bf03c5182aa1bae2def06525a059f32ff0d373fb3f9326aae160.zip" -> "builds/6c754cfd284e73f5b606a20a9e3be2440443b9087ebb22a46d9871aae0d45f13.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-DownloadGrantsGovDB"
      ~ last_modified                  = "2023-06-09T16:12:09.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:33" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:33/invocations" -> (known after apply)
      ~ s3_key                         = "builds/f929941cc22bb214e2f80992b4de9a80379e19fbba521554dd058d81cbff3a9c.zip" -> "builds/b8b5630badd29494d60895dbf7a0d223044bf3f26ecb2f4e9db96dcba944be54.zip"
      ~ s3_object_version              = "rdAg0TcY0eT9FYZdDXJjXRp7dZaMhDF_" -> (known after apply)
        tags                           = {}
      ~ version                        = "33" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                        = "git.commit.sha:0269adc401dc80dc8dfa65cea10aa713a18e3826,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb" -> "git.commit.sha:c0b2fcb5cb4476d145da449399765cef2ffa5171,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
              ~ "DD_VERSION"                     = "0269adc401dc80dc8dfa65cea10aa713a18e3826" -> "c0b2fcb5cb4476d145da449399765cef2ffa5171"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "33" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "fd62110a2b0f17edcfbbefdfbf99aae2-2" -> (known after apply)
      ~ id                     = "builds/f929941cc22bb214e2f80992b4de9a80379e19fbba521554dd058d81cbff3a9c.zip" -> (known after apply)
      ~ key                    = "builds/f929941cc22bb214e2f80992b4de9a80379e19fbba521554dd058d81cbff3a9c.zip" -> "builds/b8b5630badd29494d60895dbf7a0d223044bf3f26ecb2f4e9db96dcba944be54.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/f929941cc22bb214e2f80992b4de9a80379e19fbba521554dd058d81cbff3a9c.zip" -> "builds/b8b5630badd29494d60895dbf7a0d223044bf3f26ecb2f4e9db96dcba944be54.zip"
-       tags                   = {} -> null
      ~ version_id             = "rdAg0TcY0eT9FYZdDXJjXRp7dZaMhDF_" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/b8b5630badd29494d60895dbf7a0d223044bf3f26ecb2f4e9db96dcba944be54.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/b8b5630badd29494d60895dbf7a0d223044bf3f26ecb2f4e9db96dcba944be54.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1299322516270349493" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/f929941cc22bb214e2f80992b4de9a80379e19fbba521554dd058d81cbff3a9c.zip" -> "builds/b8b5630badd29494d60895dbf7a0d223044bf3f26ecb2f4e9db96dcba944be54.zip"
          ~ "timestamp" = "1686327077248441000" -> "1687388320661447000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "4410308662990564269" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/f929941cc22bb214e2f80992b4de9a80379e19fbba521554dd058d81cbff3a9c.zip" -> "builds/b8b5630badd29494d60895dbf7a0d223044bf3f26ecb2f4e9db96dcba944be54.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-EnqueueFFISDownload"
      ~ last_modified                  = "2023-06-09T16:12:06.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:13" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-EnqueueFFISDownload:13/invocations" -> (known after apply)
      ~ s3_key                         = "builds/9af9105f19c1e8018ea8f46cc5f6b4da1332663cbd07df0bb5053c3ab7b82fe2.zip" -> "builds/af39cb92e085fb5d1d81ca6f2257d8b660b101485d163de578d54a1668fdf36d.zip"
      ~ s3_object_version              = ".0DfvgAPstcwlH6poI9ST5bgFMwl63rG" -> (known after apply)
        tags                           = {}
      ~ version                        = "13" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:0269adc401dc80dc8dfa65cea10aa713a18e3826,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload" -> "git.commit.sha:c0b2fcb5cb4476d145da449399765cef2ffa5171,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:enqueueffisdownload"
              ~ "DD_VERSION"                   = "0269adc401dc80dc8dfa65cea10aa713a18e3826" -> "c0b2fcb5cb4476d145da449399765cef2ffa5171"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "13" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d45837b4937e8dc25c38193c3cbfe346-2" -> (known after apply)
      ~ id                     = "builds/9af9105f19c1e8018ea8f46cc5f6b4da1332663cbd07df0bb5053c3ab7b82fe2.zip" -> (known after apply)
      ~ key                    = "builds/9af9105f19c1e8018ea8f46cc5f6b4da1332663cbd07df0bb5053c3ab7b82fe2.zip" -> "builds/af39cb92e085fb5d1d81ca6f2257d8b660b101485d163de578d54a1668fdf36d.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/9af9105f19c1e8018ea8f46cc5f6b4da1332663cbd07df0bb5053c3ab7b82fe2.zip" -> "builds/af39cb92e085fb5d1d81ca6f2257d8b660b101485d163de578d54a1668fdf36d.zip"
-       tags                   = {} -> null
      ~ version_id             = ".0DfvgAPstcwlH6poI9ST5bgFMwl63rG" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-EnqueueFFISDownload
                            cd bin/EnqueueFFISDownload
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/af39cb92e085fb5d1d81ca6f2257d8b660b101485d163de578d54a1668fdf36d.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/af39cb92e085fb5d1d81ca6f2257d8b660b101485d163de578d54a1668fdf36d.plan.json"
+       id                   = (known after apply)
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4807589454930968815" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/9af9105f19c1e8018ea8f46cc5f6b4da1332663cbd07df0bb5053c3ab7b82fe2.zip" -> "builds/af39cb92e085fb5d1d81ca6f2257d8b660b101485d163de578d54a1668fdf36d.zip"
          ~ "timestamp" = "1686327096746604000" -> "1687388339015294000"
        }
    }

  # module.EnqueueFFISDownload.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1230952358128535823" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/9af9105f19c1e8018ea8f46cc5f6b4da1332663cbd07df0bb5053c3ab7b82fe2.zip" -> "builds/af39cb92e085fb5d1d81ca6f2257d8b660b101485d163de578d54a1668fdf36d.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2023-06-09T16:12:08.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-ExtractGrantsGovDBToXML:2/invocations" -> (known after apply)
      ~ s3_key                         = "builds/4ff3bb78e9dbbbc101ab3b965c735639bbc44ea326f6090d5195d429db1ac9af.zip" -> "builds/635ef27f287c030ccfb8bdc92e750806a8a37f7463729784ef601f87d267d6f6.zip"
      ~ s3_object_version              = "nk6RAvpfH_I7mW1M4XwFTWKSOi0lXbxL" -> (known after apply)
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                      = "git.commit.sha:0269adc401dc80dc8dfa65cea10aa713a18e3826,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml" -> "git.commit.sha:c0b2fcb5cb4476d145da449399765cef2ffa5171,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:extractgrantsgovdbtoxml"
              ~ "DD_VERSION"                   = "0269adc401dc80dc8dfa65cea10aa713a18e3826" -> "c0b2fcb5cb4476d145da449399765cef2ffa5171"
                # (11 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "2" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "1cd9fd818db85deef67d6b6a6fabef33-2" -> (known after apply)
      ~ id                     = "builds/4ff3bb78e9dbbbc101ab3b965c735639bbc44ea326f6090d5195d429db1ac9af.zip" -> (known after apply)
      ~ key                    = "builds/4ff3bb78e9dbbbc101ab3b965c735639bbc44ea326f6090d5195d429db1ac9af.zip" -> "builds/635ef27f287c030ccfb8bdc92e750806a8a37f7463729784ef601f87d267d6f6.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/4ff3bb78e9dbbbc101ab3b965c735639bbc44ea326f6090d5195d429db1ac9af.zip" -> "builds/635ef27f287c030ccfb8bdc92e750806a8a37f7463729784ef601f87d267d6f6.zip"
-       tags                   = {} -> null
      ~ version_id             = "nk6RAvpfH_I7mW1M4XwFTWKSOi0lXbxL" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-ExtractGrantsGovDBToXML
                            cd bin/ExtractGrantsGovDBToXML
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/635ef27f287c030ccfb8bdc92e750806a8a37f7463729784ef601f87d267d6f6.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/635ef27f287c030ccfb8bdc92e750806a8a37f7463729784ef601f87d267d6f6.plan.json"
+       id                   = (known after apply)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5767693381188881350" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/4ff3bb78e9dbbbc101ab3b965c735639bbc44ea326f6090d5195d429db1ac9af.zip" -> "builds/635ef27f287c030ccfb8bdc92e750806a8a37f7463729784ef601f87d267d6f6.zip"
          ~ "timestamp" = "1686327096329471200" -> "1687388338963430800"
        }
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "5026064096943954996" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/4ff3bb78e9dbbbc101ab3b965c735639bbc44ea326f6090d5195d429db1ac9af.zip" -> "builds/635ef27f287c030ccfb8bdc92e750806a8a37f7463729784ef601f87d267d6f6.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistFFISData"
      ~ last_modified                  = "2023-06-09T16:12:08.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistFFISData:3/invocations" -> (known after apply)
      ~ s3_key                         = "builds/14e827daf9ce6e42298f105253e6bdcd175f1b054b309ac42224e4e99349b767.zip" -> "builds/63539012fa67a9aca77f169a6064a3241b5e920a3594f27453c9b477f01f23a0.zip"
      ~ s3_object_version              = "wg24DYeayevksD9u66jaj28A.KcPJyPL" -> (known after apply)
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:0269adc401dc80dc8dfa65cea10aa713a18e3826,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata" -> "git.commit.sha:c0b2fcb5cb4476d145da449399765cef2ffa5171,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistffisdata"
              ~ "DD_VERSION"                    = "0269adc401dc80dc8dfa65cea10aa713a18e3826" -> "c0b2fcb5cb4476d145da449399765cef2ffa5171"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "3" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "6e0206331391e2966cc81820a445c4a5-2" -> (known after apply)
      ~ id                     = "builds/14e827daf9ce6e42298f105253e6bdcd175f1b054b309ac42224e4e99349b767.zip" -> (known after apply)
      ~ key                    = "builds/14e827daf9ce6e42298f105253e6bdcd175f1b054b309ac42224e4e99349b767.zip" -> "builds/63539012fa67a9aca77f169a6064a3241b5e920a3594f27453c9b477f01f23a0.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/14e827daf9ce6e42298f105253e6bdcd175f1b054b309ac42224e4e99349b767.zip" -> "builds/63539012fa67a9aca77f169a6064a3241b5e920a3594f27453c9b477f01f23a0.zip"
-       tags                   = {} -> null
      ~ version_id             = "wg24DYeayevksD9u66jaj28A.KcPJyPL" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistFFISData
                            cd bin/PersistFFISData
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/63539012fa67a9aca77f169a6064a3241b5e920a3594f27453c9b477f01f23a0.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/63539012fa67a9aca77f169a6064a3241b5e920a3594f27453c9b477f01f23a0.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistFFISData.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4246614586482010753" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/14e827daf9ce6e42298f105253e6bdcd175f1b054b309ac42224e4e99349b767.zip" -> "builds/63539012fa67a9aca77f169a6064a3241b5e920a3594f27453c9b477f01f23a0.zip"
          ~ "timestamp" = "1686327096602017000" -> "1687388339266527000"
        }
    }

  # module.PersistFFISData.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "4821557150267532975" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/14e827daf9ce6e42298f105253e6bdcd175f1b054b309ac42224e4e99349b767.zip" -> "builds/63539012fa67a9aca77f169a6064a3241b5e920a3594f27453c9b477f01f23a0.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2023-06-09T16:12:09.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-PersistGrantsGovXMLDB:5/invocations" -> (known after apply)
      ~ s3_key                         = "builds/2b7e0c2c242dc6a0c523795dd5e6f0134f4e5d03140d9a5b72759b797264dc84.zip" -> "builds/16120f20b5627fd289e578577691dda440b686ed62c83df8a61ac264708e6788.zip"
      ~ s3_object_version              = "8FxD7UBtjgqHCouvcMj5q2VsHrJByigM" -> (known after apply)
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                       = "git.commit.sha:0269adc401dc80dc8dfa65cea10aa713a18e3826,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb" -> "git.commit.sha:c0b2fcb5cb4476d145da449399765cef2ffa5171,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:persistgrantsgovxmldb"
              ~ "DD_VERSION"                    = "0269adc401dc80dc8dfa65cea10aa713a18e3826" -> "c0b2fcb5cb4476d145da449399765cef2ffa5171"
                # (12 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "5" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "1d75e6a00e06c71040c47dd9590f6ca5-2" -> (known after apply)
      ~ id                     = "builds/2b7e0c2c242dc6a0c523795dd5e6f0134f4e5d03140d9a5b72759b797264dc84.zip" -> (known after apply)
      ~ key                    = "builds/2b7e0c2c242dc6a0c523795dd5e6f0134f4e5d03140d9a5b72759b797264dc84.zip" -> "builds/16120f20b5627fd289e578577691dda440b686ed62c83df8a61ac264708e6788.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/2b7e0c2c242dc6a0c523795dd5e6f0134f4e5d03140d9a5b72759b797264dc84.zip" -> "builds/16120f20b5627fd289e578577691dda440b686ed62c83df8a61ac264708e6788.zip"
-       tags                   = {} -> null
      ~ version_id             = "8FxD7UBtjgqHCouvcMj5q2VsHrJByigM" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-PersistGrantsGovXMLDB
                            cd bin/PersistGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/16120f20b5627fd289e578577691dda440b686ed62c83df8a61ac264708e6788.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/16120f20b5627fd289e578577691dda440b686ed62c83df8a61ac264708e6788.plan.json"
+       id                   = (known after apply)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "3708799813599186642" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/2b7e0c2c242dc6a0c523795dd5e6f0134f4e5d03140d9a5b72759b797264dc84.zip" -> "builds/16120f20b5627fd289e578577691dda440b686ed62c83df8a61ac264708e6788.zip"
          ~ "timestamp" = "1686327077640445000" -> "1687388320428648000"
        }
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "7945258947736888365" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/2b7e0c2c242dc6a0c523795dd5e6f0134f4e5d03140d9a5b72759b797264dc84.zip" -> "builds/16120f20b5627fd289e578577691dda440b686ed62c83df8a61ac264708e6788.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitFFISSpreadsheet"
      ~ last_modified                  = "2023-06-09T16:12:09.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:4" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitFFISSpreadsheet:4/invocations" -> (known after apply)
      ~ s3_key                         = "builds/b16b6a6f34244e772658768f7143e5c0a8640ef516a665272f5ebd0e8bce77b3.zip" -> "builds/14d02d4c6cd86425e006ea4318ab70f66d63fbe10fca06acfb24f96db6e6adff.zip"
      ~ s3_object_version              = "24rSj97U4Dvxa9v_2dupS3pFRTy_9cXw" -> (known after apply)
        tags                           = {}
      ~ version                        = "4" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:0269adc401dc80dc8dfa65cea10aa713a18e3826,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet" -> "git.commit.sha:c0b2fcb5cb4476d145da449399765cef2ffa5171,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitffisspreadsheet"
              ~ "DD_VERSION"                       = "0269adc401dc80dc8dfa65cea10aa713a18e3826" -> "c0b2fcb5cb4476d145da449399765cef2ffa5171"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "4" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "ff20b26354862ac79ced1209bc9cdb57-2" -> (known after apply)
      ~ id                     = "builds/b16b6a6f34244e772658768f7143e5c0a8640ef516a665272f5ebd0e8bce77b3.zip" -> (known after apply)
      ~ key                    = "builds/b16b6a6f34244e772658768f7143e5c0a8640ef516a665272f5ebd0e8bce77b3.zip" -> "builds/14d02d4c6cd86425e006ea4318ab70f66d63fbe10fca06acfb24f96db6e6adff.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/b16b6a6f34244e772658768f7143e5c0a8640ef516a665272f5ebd0e8bce77b3.zip" -> "builds/14d02d4c6cd86425e006ea4318ab70f66d63fbe10fca06acfb24f96db6e6adff.zip"
-       tags                   = {} -> null
      ~ version_id             = "24rSj97U4Dvxa9v_2dupS3pFRTy_9cXw" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitFFISSpreadsheet
                            cd bin/SplitFFISSpreadsheet
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/14d02d4c6cd86425e006ea4318ab70f66d63fbe10fca06acfb24f96db6e6adff.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/14d02d4c6cd86425e006ea4318ab70f66d63fbe10fca06acfb24f96db6e6adff.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "4349985905186074214" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/b16b6a6f34244e772658768f7143e5c0a8640ef516a665272f5ebd0e8bce77b3.zip" -> "builds/14d02d4c6cd86425e006ea4318ab70f66d63fbe10fca06acfb24f96db6e6adff.zip"
          ~ "timestamp" = "1686327097023874000" -> "1687388339373432000"
        }
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "1117248018630276607" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/b16b6a6f34244e772658768f7143e5c0a8640ef516a665272f5ebd0e8bce77b3.zip" -> "builds/14d02d4c6cd86425e006ea4318ab70f66d63fbe10fca06acfb24f96db6e6adff.zip"
            # (4 unchanged elements hidden)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-staging-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2023-06-09T16:12:08.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:32" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:32/invocations" -> (known after apply)
      ~ s3_key                         = "builds/e11b8ebe4817435d85ed14ab8c6a5945844e187348978a36907859a7d02c389d.zip" -> "builds/939ccee0596d94d45bcf5e9275a2d360e39ee99129ec165e5997aad3b43dccce.zip"
      ~ s3_object_version              = "_RIn4RRRCFPjyzfe.m_BB0zHnAw64Tyj" -> (known after apply)
        tags                           = {}
      ~ version                        = "32" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_TAGS"                          = "git.commit.sha:0269adc401dc80dc8dfa65cea10aa713a18e3826,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb" -> "git.commit.sha:c0b2fcb5cb4476d145da449399765cef2ffa5171,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
              ~ "DD_VERSION"                       = "0269adc401dc80dc8dfa65cea10aa713a18e3826" -> "c0b2fcb5cb4476d145da449399765cef2ffa5171"
                # (15 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "32" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "aa8d30a10e7838bfda369bc2c08f5559-2" -> (known after apply)
      ~ id                     = "builds/e11b8ebe4817435d85ed14ab8c6a5945844e187348978a36907859a7d02c389d.zip" -> (known after apply)
      ~ key                    = "builds/e11b8ebe4817435d85ed14ab8c6a5945844e187348978a36907859a7d02c389d.zip" -> "builds/939ccee0596d94d45bcf5e9275a2d360e39ee99129ec165e5997aad3b43dccce.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source                 = "builds/e11b8ebe4817435d85ed14ab8c6a5945844e187348978a36907859a7d02c389d.zip" -> "builds/939ccee0596d94d45bcf5e9275a2d360e39ee99129ec165e5997aad3b43dccce.zip"
-       tags                   = {} -> null
      ~ version_id             = "_RIn4RRRCFPjyzfe.m_BB0zHnAw64Tyj" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/939ccee0596d94d45bcf5e9275a2d360e39ee99129ec165e5997aad3b43dccce.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/939ccee0596d94d45bcf5e9275a2d360e39ee99129ec165e5997aad3b43dccce.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "8164525510731337965" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/e11b8ebe4817435d85ed14ab8c6a5945844e187348978a36907859a7d02c389d.zip" -> "builds/939ccee0596d94d45bcf5e9275a2d360e39ee99129ec165e5997aad3b43dccce.zip"
          ~ "timestamp" = "1686327077383871000" -> "1687388320508920000"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
      ~ id       = "4017243223174389673" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "built_output_path"    = "builds/e11b8ebe4817435d85ed14ab8c6a5945844e187348978a36907859a7d02c389d.zip" -> "builds/939ccee0596d94d45bcf5e9275a2d360e39ee99129ec165e5997aad3b43dccce.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 40 to add, 13 to change, 32 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/5339707913)*